# DesignHVACLoadperArea Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Space..::..DesignHVACLoadperArea Property
Space Class See Also
---
Get or set the Design HVAC Load per Area of the Space.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double DesignHVACLoadperArea { get; set; }
```

Visual Basic
---
```text
Public Property DesignHVACLoadperArea As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double DesignHVACLoadperArea {
	double get ();
	void set (double value);
}
```

# Remarks
This property is used to get or set the Design HVAC Load per Area (Unit: W/ft2) of the Space.
# See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace